tap "codecrafters-io/tap"
tap "homebrew/bundle"
tap "microsoft/git"
tap "riscv/riscv"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generate documentation for several programming languages
brew "doxygen"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Language Server for the Lua language
brew "lua-language-server"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# OCaml package manager
brew "opam"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# CodeCrafters CLI
brew "codecrafters-io/tap/codecrafters"
# Enable Windows-like alt-tab
cask "alt-tab"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# GPU-based terminal emulator
cask "kitty"
# Break time reminder app
cask "lookaway"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# PDF viewer designed for reading research papers and technical books
cask "sioyek"
vscode "christian-kohler.path-intellisense"
vscode "maximedenes.vscoq"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.everforest"
vscode "vscodevim.vim"
