tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "microsoft/git"
tap "riscv/riscv"
brew "bat"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "doxygen"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "git-gui"
brew "lua-language-server"
brew "neovim"
brew "openjdk"
brew "qemu"
brew "ripgrep"
brew "stow"
brew "tree"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "riscv/riscv/riscv-tools"
cask "alt-tab"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager-core"
cask "kitty"
cask "sioyek"
vscode "christian-kohler.path-intellisense"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.everforest"
vscode "vscodevim.vim"
