tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "microsoft/git"
tap "riscv/riscv"
brew "bat"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "doxygen"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "git-gui"
brew "llvm"
brew "llvm@14"
brew "neovim"
brew "openjdk"
brew "qemu"
brew "ripgrep"
brew "stow"
brew "tree"
brew "zsh-syntax-highlighting"
brew "riscv/riscv/riscv-tools"
cask "alt-tab"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager-core"
cask "kitty"
vscode "azemoh.one-monokai"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "mongodb.mongodb-vscode"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "PKief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.everforest"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
